Revit 2020 API
ParameterElement.GetDefinition Method
 Get the definition representing this parameter element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2016
Syntax
C#
public InternalDefinition GetDefinition()
Visual Basic
Public Function GetDefinition As InternalDefinition
Visual C++
public:
InternalDefinition^ GetDefinition()
Return Value
 The parameter.
See Also
ParameterElement Class
Autodesk.Revit.DB Namespace